const SECURITY =
'''
개인정보 처리방침
   1. 총직
   2. 개인정보의 수집 및 이용 목적
   3. 개인정보의 수집 항목
   4. 개인정보의 수집 방법
   5. 개인정보 처리의 위탁
   6. 개인정보의 보유 및 이용기간
   7. 장기 미이용 회원 개인정보 분리 보관
   8. 개인정보의 파기 절차 및 방법
   9. 개인정보의 자동 수집 장치(쿠키)의 설치, 운영 및 그 거부 방법
  10. 이용자의 권리와 의무
  11. 개인정보보호를 위한 기술적, 관리적 대책
  12. 의견 수렴 및 불만 처리
  13. 개인정보 관리책임자
  14. 고지의 의무
   1. 총직
       (1) ㈜엔티아이 (이하 ‘회사’라 합니다)는 ‘회원’의 개인정보를 매우 중요하게 생각합니다.
       (2) ‘회사’는 ‘회원’의 개인정보를 적극적으로 보호하기 위하여 ‘개인정보처리방침’을 제정하고 이를 준수하고 있습니다. 
       (3) ‘회사’는 ‘개인정보처리방침’을 통해 ‘회원’의 어떤 개인정보 항목을, 어떤 목으로 수집되고 있으며, 어떻게 보호조치가 되고 있는지
             알려드립니다.
  
   2. 개인정보의 수집 목적 및 이용 목적
      ‘회사’는 다음의 목적으로 ‘회원’의 개인정보를 수집하고 있습니다.
      (1) 본인 확인 및 가입 의사 확인, 회원에 대한 고지 전달, 통합 ID 관리, 포인트/적립 사용 정산, 고객센터 운영, 불량회원 부정이용 방지 및 
            비인가 사용 방지
      (2) 사은/판촉행사 등 각종 이벤트, 행사 관련 정보안내 및 제반 마케팅 활동, 당사 및 제휴사 상품/서비스 안내 및 권유, 혜택 및 서비스 개
            발을 위한 통계분석 및 연구조사.
 
   3. 개인정보의 수집 항목
      ‘회사’는 다음과 같이 ‘회원’의 개인정보를 수집하고 있습니다. 단, ‘회원’의 기본적 인권 침해의 우려가 있는 민감한 개인정보(인종 및 민족,
      사상 및 신조, 출신지 및 본적지, 정치적 성향 및 범죄기록, 건강상태 및 성생활 등)와 주민등록번호는 법령상 근거 없이 불필요하게 수집하지 
      않습니다.
       1) 필수항목
            - 공통: 아이디(차량번호, FLEET 사업자등록번호), 비밀번호, 이름, 전화번호, 이메일, 입금계좌정보, 카드 정보
       2) 서비스 이용 또는 사업처리 과정에서 생성/수집되는 정보
             - IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록, 기기정보 등
             - 단말기기정보(모델명/단말식별번호/OS버전), 단말접속일시, PUSH토큰 등
 
   4. 개인정보의 수집방법
       당사는 다음의 각 호와 같은 방법으로 개인정보를 수집합니다.
       1) 홈페이지(PC/모바일) 및 모바일 앱 이용
       2) 사업자(FLEET)로 부터의 제공
       3) 로그 분석 프로그램을 통한 생성 정보 수집
       4) 쿠키(cookie)에 의한 정보 수집
       5) 키오스크 이용에 의한 정보 수집
 
   5. 개인정보 처리의 위탁
       ‘회사’는 보다 나은 서비스 제공, 고객 편의 제공 등 원활한 업무 수행을 위하여 다음과 같이 개인정보 취급업무를 외부 전문업체에 위탁
       하여 운영하고 있습니다. 이 때, 회      사는 업무 처리를 위하여 해당 업체의 업무 수행에 필요한 최소한의 정보만을 제공하고 있으며, 개
       인정보가 안전하게 관리될 수 있도록 필요한 사항을 개인정보 위탁협약서 등 에 규정하고, 이를 관리/감독하고 있습니다.
 
   6. 개인정보의 보유 및 이용기간
       (1) ‘회사’는 개인정보의 처리 목적이 달성될 때까지 개인정보를 보유합니다. 단, 정보주체로부터 사전에 동의를 받은 경우 또는 상법 등 관
            련 법령에 의하여 보존할 필요성이 있는 다음의 경우에는 개인정보를 일정기간 동안 보유 합니다.
            가. 계약 또는 청약철회 등에 관한 기록: 5년
            나. 대금 결제 및 재화 등의 공급에 관한 기록: 5년
            다. 소비자의 불만 또는 분쟁처리에 관한 기록: 3년
            라. 기타 고객의 동의를 받은 경우 동의를 받은 기간 까지
            마. 회원의 동의를 얻어 회원탈퇴 시 30일간 개인정보 보유
      (2) 고객 요구사항 처리 및 A/S 목적으로 회원탈퇴 후 30일간 ‘회원’의 개인정보를 보유합니다. 이는 고객의 실수 혹은 변심에 의해 탈퇴 신
            청 철회 시 이전 아이디 및 포인트, ‘회원’의 활동 내역 복구, 무분별한 회원탈퇴 및 재가입으로 인한 부정 이용 및 피해를 예방하기 위함
            입니다.                  
 
            단, 부정이용회원(쿠폰 부정 적립/사용 회원, 타인 명의를 이용한 적립/사용회원 등)의 경우 부정 이용 방지 및 비인가 사용 방지를 위해
            회원가입 등의 제한조치 목적으로 차량번호 아이디는 3년간 보관합니다.
 
   7. 장기 미이용 회원 개인정보 분리 보관
       (1) ‘회사’는 관련 법령에 의거하여 휴면 회원의 개인정보를 접근이 불가능한 별도의 보관장치에 분리 보관합니다.
            가. 시행 일자: 2023년 6월 28일
            나. 관련 법령: 정보통신망 이용촉진 및 정보보호 등에 관한 법률 제 29조 및 동법 시행령 제 16조
            다. 휴면 회원: 서비스를 1년 이상 이용하지 않은 회원
      (2) 다음 조건을 모두 만족하는 경우에는 휴면 회원으로 전환 됩니다.
            가. 거래이력이 1년 이상 없는 회원
            나. 서비스 홈페이지(PC/모바일웹, 앱 포함) 로그인 이력이 1년 이상 없는 회원
      (3) ‘회사’는 휴면 전환 30일 전까지 휴면 예정 회원에게 별도 분리 보관되는 사실 및 휴면 예정일, 별도 분리 보관하는 개인정보 항목을 이메
            일, 서면, 모사전송, 전화 또는 이와 유사한 방법 중 어느 하나의 방법으로 이용자에게 알립니다. 해당 통지 수단에 대한 정보가 부재 또는
            오류인 경우에는 홈페이지 공지사항 게시로 대신합니다.
      (4) 휴면 상태에서는 서비스 이용이 모두 제한되며, 별도 휴면 해제 절차를 거친 후에 정상적인 서비스 이용이 가능합니다. 단, 휴면 상태 이전
            에 발급되었던 쿠폰은 해당 유효기간 만료 시 자동 소멸되므로 재발급이 불가합니다.
 
   8. 개인정보의 파기 절차 및 방법
       (1) ‘회사’는 보유기간의 경과, 개인정보의 처리 목적 달성 등 그 개인정보가 불필요하게 되었을 때에는 ‘6. 개인정보의 보유 및 이용기간’에 따
            라 해당 정보를 지체없이 파기합니다.
       (2) 종이에 출력된 개인정보는 분쇄기로 분쇄 또는 소각하여 파기하고, 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적
             방법을 사용하여 삭제합니다.
   
   9. 개인정보의 자동 수집 장치(쿠키)의 설치, 운영 및 그 거부 방법
      (1) ‘회사’는 개인화되고 맞춤화된 서비스를 제공하기 위하여 ‘회원’의 정보를 수시로 불러오는 ‘쿠키(Cookie)’를 사용합니다.
      (2) 쿠키는 웹사이트를 운영하는데 이용되는 서버가 ‘회원’이 이용하는 브라우저에게 보내는 아주 작은 텍스트 파일로 ‘회원’이 이용하는단말기
            (PC/스마트폰/태블릿 PC            등)의 하드디스크에 저장됩니다. 이후 ‘회원’이 웹사이트에 방문할 경우 웹사이트 서버는 ‘회원’이 이용하는
            단말기의 하드디스크에 저장되어 있는 쿠키의 내용을 읽어 ‘회원’의 환경설정을 유지하고 맞춤화된 서비스를 제공하기 위해 이용됩니다.
      (3) ‘회사’의 쿠기 사용 목적은 ‘회원’이 홈페이지에 접속을 하면 ‘회원’이 방문한 홈페이지의 각 서비스나 접속 빈도, 방문 시간 및 횟수 등을 분석
            하고 ‘회원’의 이용 형태, 이벤트 참여 정보 등을 파악하여 ‘회원’을 위한 마케팅이나 개인화 서비스의 제공 등을 위하여 사용합니다. 쿠키는
            브라우저의 종료 시나 로그아웃 시 만료 됩니다.
      (4) ‘회원’은 언제든지 쿠키의 설치를 거부하거나 삭제할 수 있습니다. 이에 따라 ‘회원’은 웹브라우저에서 옵션을 설정함으로서 모든 쿠키를 허용
            하거나, 쿠키가 저장될           때 마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수 도 있습니다. 단, 쿠키의 저장을 거부할 경우  로
            그인이 필요한 일부 서비스는 이용에 어려움이 있을 수 있습니다. 쿠키 설치 허용 여부를 지정하는 방법 (Internet Explorer의 경우)은 다음의 
            각 호와 같습니다.
            가. 웹브라우저 상단의 [도구] 메뉴에서 [인터넷 옵션]
            나. [개인정보] 탭을 클릭 
            다. [고급]을 클릭
            라. 쿠키 허용 여부를 선택
 
  10. 이용자의 권리아 의무
       (1) ‘회원’은 다음 각호의 방법에 따라 ‘회원’ 본인의 개인정보를 열람 또는 정정/삭제/처리정지를 요구하거나 개인정보 제공에 관한 동의철회,
            회원가입 해지를 요청 할 수 있습니다. ‘회사는 ‘회원’의 요구를 개인정보 관련 법령에 따라 지체없이 처리할 것입니다.
           가. 홈페이지 (app.sparkpluswash.com)를 통한 ‘회원탈퇴’ 또는 ‘회원정보수정’
           나. 고객센터 (053-573-8008)를 통한 요청
           다. 개인정보 관리책임자 및 담당자 (본 ‘개인정보취급방침’ 상 ‘
 
  13. 개인정보 관리책임자’ 조항 참조)에게 서면 또는 이메일로 요청
      (2) ‘회원’은 개인정보를 최신의 상태로 정확하게 입력하여 불의의 사고를 예방할 수 있도록 협조해야 합니다. ‘회원’의 부정확한 정보 제공으로
            발생하는 사고의 책임은            ‘회원’에게 있으며, 타인 정보의 도용 등 허위 정보를 입력할 경우 ‘회원’ 자격이 상실될 수 있습니다.
      (3) ‘회원’은 개인정보를 보호받을 권리와 함께 스스로를 보호하고 타인의 정보를 침해하지 않을 의무도 가지고 있습니다. 비밀번호를 포함한
            ‘회원’의 개인정보가 유출되지 않도록 조심하고 게시물을 포함한 타인의 개인정보를 훼손하지 않도록 유의하시기 바랍니다. 만약 이 같은
            책임을 다하지 못하고 타인의 정보를 훼손할 시에는 ‘개인정보 보호법’ 등 관련 법력에 의해 처벌될 수 있습니다.
 
  11. 개인정보보호를 위한 기술적, 관리적 대책
       (1) ‘회사’는 ‘회원’의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 최선을 다하고 있으며, 다음의 각 호와
            같은 기술적 대책을 강구하고 있습니다.
            가. ‘회원’의 개인정보는 아이디와 비밀번호에 의해 관리되고 있으며, 비밀번호를 포함하는 파일 및 전송 데이터 등의 중요한 데이터는 암호
                  화 등 별도의 보안기능을 통해 보호되고 있습니다. ‘회사’는 암호화 알고리즘을 이용하여 네트워크 상의 개인정보를 안전하게 전송할 수
                  있는 보안 장치를 채택하고 있습니다.
            나. ‘회원’의 개인정보를 저장하고 관리하는 시스템은 방화벽과 침입차단시스템을 통하여 보호되며, 24시간 감시를 통하여 외부로부터의 위
                  협에 대해 관리되고 있습니다.
            다. ‘회사’는 백신프로그램을 이용하여 컴퓨터 바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로
                   업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 제공함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
       (2) ‘회사’는 ‘회원’의 개인정보를 취급함에 있어 다음의 각 호와 같은 기술적 대책을 강구하고 있습니다.
            가. ‘회원’의 개인정보에 대한 접근 권한은 업무 역할에 따라 필요한 최소한의 인원으로 제한하고 있습니다. 
            나. ‘회사’의 임직원이 업무를 함에 있어 ‘회원’의 개인정보를 보호하기 위해 지켜야 할 사내 규정을 마련하고 준수하고 있습니다.
            다. ‘회사’의 임직원이 ‘회원’의 개인정보를 취급하기 이전에 ‘개인정보 취급서약서’를 통하여 ‘회원’의 개인정보 에 대한 정보 유출을 사전에
                  방지하고 사내 규정에 대한 이행사항 및 준수 여부를 감시하기 위한 내부 절차를 마련하고 있습니다.
            라. ‘회사’ 임직원의 개인정보보호 실천을 위한 정기적인 개인정보보호 교육을 실시하고 있습니다.
       (3) ‘회사’는 상기의 기술적, 관리적 대책에도 불구하고 ‘회원’ 개인의 실수나 사고 발생 당시의 기술로 예방, 조치를 할 수 없는 불가항력 사유로
             인하여 발생한 개인정보의 분실, 도난, 누출 변조 또는 훼손에 대해서는 ‘회사’가 책임을 지지 않습니다.
 
  12. 의견 수렴 및 불만 처리
       (1) ‘회사’는 ‘회원’의 의견을 소중하게 생각하며, ‘회원’과의 원활한 의사소통을 위해 고객센터를 운영하고 있습니다. ‘회사’의 고객센터 연락처 및
            상담 가능 시간은 다음의 각 호와 같습니다.
            가. 고객센터 전화번호: 053-573-8008
            나. 고객센터 전화상담 가능 시간: 평일 9시~18시 (12시 ~ 13시 점심시간)
       (2) 기타 개인정보에 관한 상담이 필요한 경우 개인정보침해신고센터, 경찰청 사이버테러대응센터 등으로 문의하실 수 있습니다.
             가. [개인정보침해신고센터] 전화번호: 1366 / URL: http://www.1366.or.kr
             나. [경찰청 사이버테러대응센터] 전화번호: 1566-0112 / URL http://www.ctrc.go.kr
 
  13. 개인정보 관리 책임자
       ‘회사’는 수집된 ‘회원’의 개인정보를 관리를 위해 개인정보 관리책임자를 다음과 같이 지정하여 관리하고 있으며, 개인정보 관련 문의사항에
       신속하고 성실하게 답변해 드리고 있습니다.
       - 서비스담당 부서: 고객센터
         전화번호: 053-573-8008
         이메일: carwash@hanafmk.com
       - 개인정보관리책임자 성명: 전학도
         전화번호: 054-922-4020
         이메일: hdjun@hanafmk.com
  14. 고지의 의무
       (1) 본 ‘개인정보취급방침’을 포함한 기타 개인정보보호에 대한 상세한 내용은 ‘회사’가 운영하는 홈페이지 첫 화면 하단에 공개함으로써 ‘회원’
            들이 언제나 용이하게 볼 수 있도록 조치하고 있습니다. 본 ‘개인정보취급방침’의 내용은 수시로 변경될 수 있으므로 홈페이지를 방문하실
            때마다 이를 확인하시기 바랍니다.
       (2) 본 ‘개인정보취급방침’이 관련 법령 및 정책 또는 보안기술의 변경에 따라 내용의 추가 삭제 및 수정이 있을 경우 변경되는 ‘개인정보취급방
             침’을 시행하기 전에 홈페이지를 통해 변경 사유 및 내용 등을 공지 합니다. 
 
공고일자: 2022년 6월 21일 
시행일자: 2022년 6월 28일
''';
const MEMBERSHIP = 
'''
월 멤버쉽 정기 구독 이용 안내 

   1.  월 멤버쉽 프로그램은 정기구독 프로그램으로써 매월  자동 결제 됩니다.   
   2.  자동 결제는 결제일 기준으로 익월 동일 일자에 결제 됩니다. 단 익월에 동일 일자 없는 경우 익월 마지막 일자에 자동 결제가 진행 됩니다.   
   3.  자동 결제일 기준으로 카드결제 잔액부족 및 승인 거절 시 정기구독은 자동 해지 됩니다.   
   4.  결제 이후에는 결제일 기준으로 1개월간 세차장을 무제한으로 이용 가능합니다.   
   5.  월 멤버쉽은 각 차량별로 가입이 가능합니다.    
   6.  차량번호 변경은 불가능 합니다.    
   7.  월 멤버쉽 회원권을 타인 또는 타 차량에 양도는 불가능 합니다.  
   8.  자동 기기의 특성상 안전과 점검을 위해 한달에 1~2회 장비 점검 및 안전점검이 있을 수 있으니 공지에 따라 이용에 불편이 없으시길 바랍니다.     
   9.  멤버쉽 해지는 관리사무실 연락 또는 사용자웹에서 해지가 가능합니다.    
   10.  서비스 결제일로 부터 7일 이내에 세차 서비스를 이용한 횟수가 없는 경우에만 결제 취소가 가능합니다.

본 이용 약관은 2023년 6월 28일부터 시행합니다.
''';

const SERVICE =
'''
SPARK PLUS Express Car wash 이용 약관
본약관은 SPARK PLUS의 세차장 서비스의 이용과 관련하여 필요한 사항을 규정합니다.

SPARK PLUS Express Car wash 이용 약관

본약관은 SPARK PLUS의 세차장 서비스의 이용과 관련하여 필요한 사항을 규정합니다.

  제1장 총직
          제 1 조 (목적)
              1. SPARK PLUS / ㈜엔티아이(이하 ‘회사’라고 합니다) 에서 운영하는 웹사이트 SPARK PLUS 사용자앱(app.sparkpluswash.com)
                 (이하 “사용자앱”이라 합니다.)와 SPARK PLUS 키오스크(이하 “키오스크”라 합니다)에서 제공하는 세차 서비스 (이하 “서비스”
                 라 합니다.)를 이용함에 있어 본 웹사이트 이용자의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
 
          제 2 조 (용어의 정의)
              1. 본 약관에서 사용하는 용어는 다음과 같이 정의 합니다.
              2. “이용자”란 사용자앱 또는 세차장의 키오스크에 접속하여 이용하는 회원 및 비회원을 말합니다.
              3. “회원” 이란 사용자앱에 접속하여 본 약관에 따라 개인회원 또는 FLEET 회원으로 가입하여 사용자앱에서 제공하는 서비스를
                 받는자를 말합니다.
              4. “비회원”이란 회원에 가입하지 않고 세차장에서 제공하는 서비스를 이용하는 자를 말합니다.
              5. “FLEET” 이란 사용자앱에 가입하는 사업자 또는 단체를 말하며, 개인사업자, 법인사업자, 유한회사, 비영리법인, 사단, 재단,
                 동호회 단체 등이 해당 됩니다.
              6. “월 멤버쉽” 이란 사용자앱 또는 키오스크에서 매월 정기구독 결제를 신청한 회원을 말합니다.
              7. “사용자 앱” 이란 회사가 모바일 및 휴대용 기기 등을 통하여 제공하는 앱을 말합니다.
              8. “키오스크” 이란 회사가 세차장장에서 오프라인으로 결제를 할 수 있도록 지원는 하드웨어 장치를 말합니다. 
              9. “ID”라 함은 이용자가 회원가입당시 등록한 사용자의 “식별번호” (개인 차량번호 또는 FLEET ID)를 말합니다.
 
          제 3 조 (약관의 효력 및 변경)
              1. 본 약관은 회사가 사용자앱에 게시하고, 회원가입 시 본 약관에 동의함으로써 그 효력이 발생합니다.
              2. 사용자앱으로 회원가입 하지 않고 키오스크를 이용하는 이용자는 결제시 본 약관을 확인할 수 있도록 공시함으로써 효력이
                 발생 합니다.
              3. 변경된 약관은 공시하거나 고지한 적용일로부터 효력이 발생 합니다.
              4. 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 사용자 앱에 적용일자 7일 이전부터 적용일자 전일까지 공지    
                   합니다.
              5. 회원이 변경된 약관 사항에 동의하지 않을 경우, 약관의 효력 발생 전일까지 서비스 이용을 중단하거나 회원 탈퇴를 할 수 있으며, 약관의 
                  개정과 관련하여 효력 발생일 전일 까지 이의를 제기 하지 않는 경우에는 개정된 약관에 동의 한 것으로 간주 합니다.
              6. 본 약관에 명시되지 않은 사항은 정보통신촉진법, 전자상거래등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률, 전자거래기본법,
                  전자서명법, 정보통신망 이용촉진등에 관한 법률, 소비자보호법 등 기타 관계 법령에 규정되어 있을 경우에는 그 규정을 따르도록 합니다. 
 
  제 2장 회원 관리 및 서비스
          제 4 조 (이용 신청)
              1. 이용 신청자가 회원가입 안내에서 본 약관과 개인정보정책에 동의하고 가입절차를 거쳐 ‘회원가입’ 버튼을 누르면 이용 신청을 할 수
                 있습니다.
              2. 이용 신청자는 실제 정보를 사용해야 하며 개인회원의 경우 1대의 차량정보에 대하여 1개의 ID로 이용신청 할 수 있으며, FLEET의 경우
                  여러대의 등록된 차량이 1개의 ID로 이용신청 할 수 있습니다.
              3. 실제 정보를 입력하지 않은 이용자는 법적인 보호를 받을 수 없으며, 서비스 이용에 제한을 받을 수 있습니다.
 
          제 5 조 (이용신청의 승낙 및 유보)
              1. 회사는 제 4 조에 따른 이용신청자에 대하여 서비스 이용을 승낙 할 수 있습니다.
              2. 회사는 아래 사항에 해당하는 경우에 그 제한사유가 해소될 때까지 승낙을 유보할 수 있습니다.
                 가. 서비스 관련 설비에 여유가 없는 경우
                 나. 기술상 지장이 있는 경우
                 다. 기타 회사 사정상 필요하다고 인정되는 경우
             3. 회사는 아래 사항에 해당하는 경우에는 승낙을 하지 않을 수 있습니다.
                 가. 다른 사람의 명의를 사용하여 신청한 경우
                 나. 이용자 정보를 허위로 기재하여 신청한 경우
                 다. 사회의 안녕질서 또는 미풍약속을 저해할 목적으로 신청한 경우
                 라. 기타 회사가 정한 이용신청 요건이 미비한 경우
 
          제 6 조 (등록 정보의 이용)
              1. 회사는 회원 등록정보를 집단적인 통계치 형태로 사용할 수 있습니다.
              2. 회사는 관련 법령에 따른 경우를 제외하고는 회원의 동의 없이 회원 정보를 공개하지 않습니다.
              3. 회사는 회원이 회사의 권리를 침해하거나 기타 불법행위를 하는 경우, 정당한 법 절차에 따라 회원의 정보를 이용할 수 있습니다.
              4. 회사는 수사기관이 수사와 관련하여 정당한 법 절차에 따라 회원의 정보를 요구하는 경우에는 이에 응하여 회원의 등록 정보를 수사기관에 
                 제공할 수 있습니다.
 
          제 7 조 (휴먼계정 관리)
              1. 회사는 회원이 12개월 이상 로그인 하지 않으면, 휴면계정으로 간주하고 회사가 제공하는 서비스 이용을 아래와 같이 제한/상실 시킬 수 있습니다.
              2. 12개월 이상 서비스에 로그인하지 않는 경우에는 휴면계정으로 별도 사용자앱 이용이 중단되며, 이후 다시 서비스를 이용하려면 본인확인 절차를 
                 거쳐야 합니다.
              3. 회사는 휴면계정 전환 30일 전 회원이 등록한 가장 최근의 연락처로 휴면계정 전환 예정 통지를 합니다.
              4. SPARK PLUS 회원은 제 2항에도 불구하고, 사용자앱에 12개월 이상 로그인 하지 않을 경우 휴면계정으로 구분됩니다.
 
          제 8 조 (회원 탈퇴)
              1. 회원은 탈퇴를 희망하는 경우, “MY” 페이지에서 “회원 탈퇴” 버튼을 사용하여 탈퇴 신청을 합니다.
                 가. SPARK PLUS 일반회원의 경우 쿠폰 유효기간이 남아 있고, 월 멤버쉽 회원의 경우 사용 일수가 남아 있는 경우 카드의 활불 및 환급 등의 처리가
                     모두 완료된 다음에 탈퇴 할 수 있습니다.
                 나. 탈퇴 시에는 발급된 쿠폰과 사용 일수가 모두 소멸되어 재가입 시 소멸된 쿠폰과 사용 일수는 복원되지 않습니다.
              2. 회원 재가입은 회원이 가입 후 탈퇴, 재가입 등을 반복함으로써 회사가 제공하는 쿠폰, 이벤트 혜택 등 경제상의 이익을 취하거
                 나 기타 명의도용 등의 불법적인 행위 등을 방지 하기 위하여, 회원 탈퇴를 한 날로부터 30일이 경과한 경우에 가능 합니다.
              3. 회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원자격을 제한 또는 정지 시킬 수 있고, 14일의 기간을 정하여 시정하거나
                 소명할 기회를 부여한 뒤 회원의 소명이 없거나 그 소명이 정당하지 아니한 경우 회원자격을 박탈할 수 있습니다.
                 가. 타인의 회사 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
                 나. 회원 가입시 허위 내용의 등록 및 타인의 정보 도용
                 다. 관계 법령을 위배하거나 미풍양속을 저해하고자 하는 목적으로 회원가입신청을 할 경우
                 라. 본 약관에 위반한 경우
                 마. 회사 및 기타 제3자의 권리를 침해하거나 도용하였을 경우
                 바. 회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
                 사. 구매 상품을 정당한 이유 없이 상습적으로 취소 또는 반품(환불)하는 등의 방법으로 회사의 업무를 현저히 방해하는 경우
                 아. 상품 구매 및 서비스 이용 시 정상적인 거래 범위를 현저히 이탈하여 오남용하는 경우
                 자. 기타 회원으로서의 자격을 지속시키는 것이 객관적으로 부적절하다고 판단되는 경우
 
        제 9 조 (서비스의 중단)
            1. 회사는 컴퓨터 등 정보통신 설비의 보수 점검 교체 및 고장, 통신의 두절,  기타 불가항력적 사유가 발생한 경우에는 서비스의 
               제공을 일시적으로 중단 할 수 있습니다.
            2. 회사는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상하지 아
               니 합니다. 단 회사의 고의 또는 과실이 있는 경우에는 그러하지 아니 합니다.
 
        제 10 조 (회원에 대한 통지)
            1. 회사가 회원에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한 사용자앱 공지사항, 문자 메세지, 모바일 애플리케이션 푸
               쉬, 메신저 알림톡  등으로 할 수 있습니다.
            2. 회사는 회원 전체에 대한 통지의 경우 7일 이상 회사의 공지사항에 게시함으로써 제1항의 통지에 갈음할 수 있습니다. 다만, 회
               원 본인의 거래와 관하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.
 
        제 11 조 (정보의 제공 및 광고의 게제)
            1. 회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 문자 메세지, 모바일 애플리케이션 푸쉬, 메신
               저 알림톡 등의 방법으로 회원에게 제공할 수 있습니다. 다만, 회원은 관련법에 따른 거래관련 정보 및 고객 문의 등에 대한 답변
               등을 제외하고는 언제든지 수신 거절을 할 수 있습니다.
            2. 제1항의 정보를 문자 메세지, 모바일 애플리케이션 푸쉬, 메신저 알림톡 등을 통하여 전송하려고 하는 경우에는 회원의 사전 동
               의를 받아서 전송합니다. 다만, 회원의 거래관련 정보 및 고객문의 등에 대한 회신에 있어서는 그러하지 않습니다.
 
        제 12 조 (업무의 제휴)
            1. 회사는 이용자의 편의를 도모하고 효과적인 서비스의 일정 부분에 대해 다른 회사와 제휴할 수 있습니다.
            2. 제휴 회사가 서비스와 관련하여 진행한 활동은 회사가 직접 시행한 활동에 준하는 효력이 있습니다.

        제 13 조 (쿠폰)
            1. 쿠폰의 구체적인 운영 방침이나 활용 방법 및 혜택은 회사의 마케팅 정책에 따라 변경될 수 있으며, 이에 대해서는 별도의 방법
               으로 사전에 안내해 드립니다. 
            2. 쿠폰으로 결제 시 회사에서 정한 기준에 따라 할인이 적용 될 수 있습니다.
 
  제 3 장 월 멤버쉽 정기 구독 서비스
        제 14 조 (적용의 범위)
            본 장의 규정은 SPARK PLUS 월 멤버쉽 정기 구독 서비스를 이용하고자 하는 모든 이용자에게 그 효력이 발생합니다.
 
        제 15 조 (월 멤버쉽 서비스 이용에 관한 총칙)
            1. 이용의 제한
               가. 회원은 4가지의 월 멤버쉽 서비스를 가입 할 수 있습니다.
               나. 회사는 다음 각 호에 해당하는 경우 이용자에게 멤버쉽 가입을 제한하거나 중단할 수 있습니다.
                    (1) 운영 관련 설비의 장애 및 보수, 정전, 이용량의 폭주 등 기술상 서비스를 제공 할 수 없는 경우
                    (2) 이용자가 타인 명의로 서비스를 이용하는 경우
                    (3) 이용자가 회사의 페이 서비스 정책 또는 본 약관을 위반하여 서비스를 이용하고자 하는 경우
                    (4) 이용자가 페이 서비스의 시스템을 무단으로 침범하는 경우
                    (5) 기타 회사가 별도로 정하여 공지한 요건을 충족하지 않는 경우
               다.  본 조에 따라 월 멤버쉽 서비스 제한이나 중단이 있을 때에는 회사가 제 10 조에서 정한 방법으로 회원에게 해당 내용을 통지
                     합니다. 다만, 회사가 통제할 수 없는 사유로 페이 서비스가 중단(회사의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)되는
                     등 미리 통지 할 수 없는 상황이 발생했을 때에는 그러하지 않습니다.
            2. 월 멤버쉽 서비스의 이용시간
               가. 월 멤버쉽 서비스의 이용은 회사가 정한 휴일을 제외한 08:00 ~ 22:00 이용을 원칙으로 합니다. 다만, 회사의 업무나 기술상의 
                    이유로 월 멤버쉽 서비스가 일시 중지될 수 있고, 운영상의 목적으로 회사가 정한 기간에는 월 멤버쉽 서비스가 일시 중지될 
                    수 있습니다. 이때 회사는 미리 해당 내용을 공지하며, 부득이하면 사후에 통보할 수 있습니다.
               나. 회사는 월 멤버쉽 서비스를 일정 범위로 나누어 범위 별로 이용할 수 있는 시간을 정할 수 있으며, 이 경우 그 내용을 공지 
                    합니다.
            3. 월 멤버쉽 서비스 이용에 대한 이용자의 의무와 책임
               회사가 정상적으로 월 멤버쉽 서비스를 제공한 경우 월 멤버쉽 서비스 이용 시 발생하는 개인 간의 모든 민.형사상 책임은 
               이용자에게 있습니다.
            4. 발행 및 지급보증
               월 멤버쉽 서비스는 전자상거래(결제 수단) 보증보험증권에 가입되어 있습니다.
 
        제 16 조 (취소 등)
            1. 월 멤버쉽 서비스 결제 취소
               가. 이용자는 월 멤버쉽 서비스 최초 결제일로부터 7일 이내 결제 영수증을 지참하고, 세차 서비스를 이용한 횟수가 없는 경우에만
                   결제 취소를 요청 할 수 있으며, 회사는 최초 결제 금액의 100%를 원 결제수단의 승인 취소 또는 환급으로 취소합니다. 선물 결
                   제 취소의 기한은 상품의 종류와 특성 그리고 회사의 사저에 따라 달리 정할 수 있습니다. 
               나. 이용자가 1호에 해당하지 않는 결제 취소를 요청을 한 경우에는 회사는 결제금액을 반환하지 않으며, 월 멤버쉽 서비스만 즉시 
                    해지합니다.
            2. 면책 사항
               가. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 월 멤버쉽 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책
                   임이 면제 됩니다.
               나. 회사는 이용자의 귀책사유로 인한 월 멤버쉽 서비스의 이용 장애에 대하여 책임을 지지 않습니다.
               다. 회사는 다음 각 호에서 예시하는 바와 같이 이용자가 불법 또는 부정한 방법으로 월 멤버쉽 서비스를 이용하거나 과실에 해당
                   하는 행위를 하여 이용자 상호 간 또는 이용자와 제3자 상호 간에 분쟁이 발생하였을 때 회사의 책임을 주장하는 자가 회사의
                   귀책사유를 객관적으로 입증하지 않는 한 이에 개입할 의무가 없으며 분쟁으로 발생하는 손해를 배상할 책임이 없습니다.
                   (1) 타인의 휴대전화(분실된 전화 포함)를 이용하거나 번호를 무단으로 사용하여 월 멤버쉽 서비스를 이용한 경우
                   (2) 이용자가 월 멤버쉽 서비스를 불법 할인 등의 목적으로 구매하여 제3자 또는 수신자에게 전송(판매)하는 경우
                   (3) 이용자가 계좌 정보 등 환불 관련 정보를 잘못 입력하여 환불 오류가 발생한 경우
 
        제 17 조 (계약 당사자의 의무)
            1. 회사의 의무
               가. 회사는 월 멤버쉽 서비스와 관련한 이용자의 불만사항이 접수되면 이를 신속히 처리해야 하며, 신속한 처리가 어려운 경우
                    그 사유와 처리 일정을 월 멤버쉽 서비스 화면에 게시하거나 휴대전화 문자 메세지, 모바일 애플리케이션 푸쉬, 메신저 알
                    림톡 등을 통하여 해당 이용자에게 통지 합니다.
               나. 회사가 제공하는 월 멤버쉽 서비스로 인하여 이용자에게 손해가 발생 하였을 때 그러한 손해가 회사의 고의나 과실로 인
                    하여 발생 하였다면 회사가 그 책임을 부담하며, 책임의 범위는 통상 손해에 한합니다.
            2. 이용자의 의무
               가. 이용자는 월 멤버쉽 서비스를 이용할 때 다음 각 호의 행위를 해서는 안됩니다.
                   (1) 부정하게 월 멤버쉽 서비스에 접속하여 사용하는 행위
                   (2) 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙없이 복제 또는 유통하거나 상업적으로 이용하는 행위
                   (3) 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 행위
                   (4) 공공질서와 미풍양속에 위반되는 내용 등을 타인에게 유포하는 행위
                   (5) 월 멤버쉽 서비스 운영을 고의로 방해하는 행위
                   (6) 월 멤버쉽 서비스에 게시된 정보를 변경하는 행위
                   (7) 기타 불법적이거나 부당한 행위
               나. 이용자는 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하
                   며, 기타 회사의 업무에 방해되는 행위를 해서는 안 됩니다.
            3. 회원 및 비회원의 의무
               가. 회원 및 비회원은 관계 법령, 약관, 서비스 이용안내 및 월 멤버쉽 서비스상에 공지한 주의사항, 회사가 월 멤버쉽 서비스 이
                   용과 관련하여 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 해서는 안됩니다.
               나. 회원 및 비회원은 본 약관에서 별도로 정하거나 회사의 분명한 동의가 있는 때가 아니면 월 멤버쉽 서비스 이용 권한을 타인
                   에게 양도, 증여 또는 이용하게 하거나 이를 담보로 제공 할 수 없습니다.
                   (1) 월 멤버쉽 서비스 이용신청 또는 변경 시 거짓된 정보를 기재하거나 타인의 개인정보를 이용하는 행위
                   (2) 월 멤버쉽 서비스 이용 중 습득한 게시물 또는 정보를 상업적 목적으로 이용하거나 출판, 방송 등을 통하여 제3자에게 노
                       출하는 행위. 다만, 공익 목적을 위하여 필요한 경우 사전에 회사의 동의를 얻어야 함.
                   (3) 회사의 월 멤버쉽 서비스 운영이나 다른 이용자의 페이 서비스 이용을 방해하는 행위와 자신을 회사의 운영진, 직원 또는
                       관계자라라고 속이는 행위
                   (4) 월 멤버쉽 서비스를 제3자와 유상으로 거래하거나 현금으로 전환하는 행위
                   (5) 기타 불법적이거나 회사에게 피해를 발생시키는 행위
 
  제 4 장 재화의 주문 및 결제 관련
        제 18 조 (결제 방법)
            이용자는 회사에서 판매하는 재화 및 서비스에 대하여 신용카드, 현금, 간편 결제 등의 각종 결제 수단을 이용하여 결제 할 수 
            있습니다.
            1. 회사는 이용자의 구매 및 결제 신청이 있는 경우 이용자에게 구매 및 결제를 확인 할 수 있도록 사용자앱 또는 키오스크를
               통해 구매 영수증을 제공합니다.
            2. 구매영수증을 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 구매영수증을 받은 후 즉시 구매신청 변경 및 결제 
               취소를 요청 할 수 있으며, 회사는 재화 및 서비스 이용 전에 이용자의 요청이 있는 경우에는 회사의 취소 및 환불 규정에
               의거하여 필요한 조치를 합니다.
        제 19 조 (취소 및 환불 규정)
            1. 회사는 이용자가 구매/결제한 재화 및 서비스 등이 품절 또는 설비 고장 등의 사유로 인도 또는 제공을 할 수 없을 때에는 
               지체 없이 그 사유를 이용자에게 통지하고 서비스 이용 전에 재화 및 서비스 등의 대금을 받은 경우에는 대금을 받은 날로
               부터 3영업일 이내에 환급하거나 환급에 필요한 조치를 취합니다.
            2. 세차 상품 및 쿠폰 구매에 대한 취소 및 환불 규정은 부록_취소/환불 정책에 따릅니다.
 
  제 5장 기타
        제 20 조 (전자영수증의 발행 및 거래 내역의 확인)
            1. 회사는 사용자앱 및 키오스크를 통한 거래한 내역 및 그 증빙에 대하여, 전자적 형태인 전자 영수증으로 우선 발급하며,
               이용자는 이에 동의 합니다.
            2. 제1항에 포함되지 않는 거래에 해당하는 경우에는 영수증이 별도로 발행되지 않을 수 있습니다.
            3. 회원은 사용자 앱의 “전자영수증” 구매내역 메뉴를 통해 회원의 거래내역 등을 확인 할 수 있습니다.
            4. 회사는 다음 각 호에 해당하는 경우, “전자영수증” 서비스 전부 또는 일부를 제한하거나 중지할 수 있습니다. 
               가. 서비스를 위한 설비 보수, 점검, 교체 등의 사유로 일시적인 서비스 장애가 발생한 경우
               나. 제반 설비의 장애 또는 이용 폭주 등의 사유로 정상적인 서비스 이용이 어려운 경우
               다. 천재지변 등 불가항력적 사유가 발생한 경우
            5. 회사는 관련 법령에 의거하여 회원과의 거래내역을 거래가 발생한 날로부터 최대 5년간 보관하며, 해당 기간 동안 회원은
               회사가 제공하는 사용자앱을 통하여 열람 및 확인 할 수 있습니다.
 
        제 21 조 (약관의 해석)
            본 약관에 명시되지 않은 사항 또는 본 약관 해석상 다툼이 있는 경우에는 이용자와 회사의 합의에 의하여 결정 합니다. 다만, 
            합의가 이루어지지 않은 경우에는 관계법령 및 거래 관행에 따릅니다.

        제 22 조 (책임 제한)
            1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없거나 회사의 귀책사유가 없는 경우에는 책임
               을 지지 않습니다.
            2. 회사는 서비스 이용과 관련하여 이용자의 고의 또는 과실로 인하여 발생한 손해에 관하여 책임을 지지 않습니다.
 
        제 23 조 (손해 배상)
            1. 이용자가 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 이용자는 회사에 발생하는 손해를 배상해
               야 합니다.
            2. 서비스를 이용하면서 불법행위나 본 약관을 위반하는 행위를 한 이용자로 말미암아 회사가 해당 이용자 이외의 제3자로부터
               손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는다면 해당 이용자는 자신의 책임과 비용으로 회사를 면책 시켜야 하
               며, 회사가 면책되지 못한 경우 당해 이용자는 그로 인하여 회사에 발생한 손해를 배상해야 합니다.
 
       제 24 조 (관할 법원)
           본 약관과 관련하여 회사와 이용자 사이에 발생한 분쟁에 관한 소송은 회사의 소재지를 관할하는 법원 또는 민사소송상의 관할법원을 관할법원으로 합니다.
 
본 이용약관은 2022년 7월 7일부터 시행합니다.


''';

// Essential Data
const AUTH_KEY = 'c83b4631-ff58-43b9-8646-024b12193202';
const ONE_TIME = 'PGC001';
// api path
const GET_MAIN_PRODUCT = 'http://localhost:8000/getmainproduct';
const GET_OPT_MENU = 'http://localhost:8000/getoptmenu';
const SET_WASH_PAY = 'http://localhost:8000/setwashpay';
const SET_APPROVAL_PAY = 'http://localhost:8000/setapprovalpay';
const SET_WASH_USE = 'http://localhost:8000/setWashuse';
const SET_WASH_CTL = 'http://localhost:8000/setWashctl';
const CHK_GO_WASH = 'http://localhost:8000/chkgowash';
const UPDATE_MERGE_CTL = 'http://localhost:8000/updatemergectl';
const SET_MEMBERSHIP_PAY = 'http://localhost:8000/setmempay';
const SET_MEM_USE = 'http://localhost:8000/setMemuse';
const CHK_SERVICE = 'http://localhost:8000/chkservice';
const GET_MEMBERSHIP = 'http://localhost:8000/getMembership';